IRP/src/Catalogs/DataBaseStatus/DataBaseStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>DataBaseStatus</name>
 <attributes>
  <name>isProduction</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SelectedStyle</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>ConnectionSettings</name>
  <attributes>
   <name>Computer</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ConnectionString</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/DataBaseStatus/ManagerModule.bsl
Function GetOrCreateDataBaseStatusInfo() Export

	If Not Saas.isAreaActive() Then
		Return Catalogs.DataBaseStatus.EmptyRef();
	EndIf;

	ComputerName = ComputerName();
	ConnectionString = InfoBaseConnectionString();

	ConnectionStringArray = StrSplit(ConnectionString, "\|/;=: ");
	ConnectionString = StrConcat(ConnectionStringArray, "_");
	Query = New Query();
	Query.Text =
	"SELECT
	|	DataBaseStatusConnectionSettings.Ref
	|FROM
	|	Catalog.DataBaseStatus.ConnectionSettings AS DataBaseStatusConnectionSettings
	|WHERE
	|	DataBaseStatusConnectionSettings.Computer = &Computer
	|	AND DataBaseStatusConnectionSettings.ConnectionString = &ConnectionString";

	Query.SetParameter("ConnectionString", ConnectionString);
	Query.SetParameter("Computer", ComputerName);

	QueryResult = Query.Execute();

	SelectionDetailRecords = QueryResult.Select();

	While SelectionDetailRecords.Next() Do
		Return SelectionDetailRecords.Ref;
	EndDo;

	NewConnection = Catalogs.DataBaseStatus.CreateItem();
	If Not Catalogs.DataBaseStatus.Select().Next() Then
		NewConnection.isProduction = True;
	EndIf;

	NewConnection.SelectedStyle = "Auto";
	For Each Lang In LocalizationReuse.AllDescription() Do
		NewConnection[Lang] = ConnectionString;
	EndDo;
	Row = NewConnection.ConnectionSettings.Add();
	Row.Computer = ComputerName;
	Row.ConnectionString = ConnectionString;

	NewConnection.Write();
	Return NewConnection.Ref;

EndFunction
